def solution(data):
    # 정렬된 길이 2부터 시작
    for i in range(1, len(data)):
        # 이번에 삽입할 값
        target = data[i]

        # 정지 조건 : target보다 큰 값을 만나야 함, 반복 횟수는 i
        k = 0
        while data[k] < target and k < i:
            k += 1
        # 정지 해석 : 처음 target보다 큰 값을 찾았거나 원래 위치로 돌아옴
        # 원래 위치로 돌아온 경우
        if k == i:
            print("유지 실행 결과:", data[:i+1], data[i+1:])
            continue
        # 삽입 위치가 k 이다 -> k부터 i-1까지를 k+1부터 i까지로 이동
        else:
            for j in range(i-1, k-1, -1):
                data[j+1] = data[j]
            data[k] = target
            print("삽입 실행 결과:", data[:i+1], data[i+1:])
    return data



data = [4, 7, 2, 8, 9, 3, 1, 10, 30, 23]
print(f'\n{solution(data)}')

'''
정렬된길이       정렬후
0 [4, 7, 2, 8, 9, 3, 1, 10, 30, 23]
1 [4/ 7, 2, 8, 9, 3, 1, 10, 30, 23]
2 [4, 7/ 2, 8, 9, 3, 1, 10, 30, 23]
3 [2, 4, 7/ 8, 9, 3, 1, 10, 30, 23]
4 [2, 4, 7, 8/ 9, 3, 1, 10, 30, 23]
5 [2, 4, 7, 8, 9/ 3, 1, 10, 30, 23]
6 [2, 3, 4, 7, 8, 9/ 1, 10, 30, 23]
7 [1, 2, 3, 4, 7, 8, 9/ 10, 30, 23]
8 [1, 2, 3, 4, 7, 8, 9, 10/ 30, 23]
9 [1, 2, 3, 4, 7, 8, 9, 10, 30/ 23]
10[1, 2, 3, 4, 7, 8, 9, 10, 23, 30] fin
'''